In [1]:
import pandas as pd
users_data=pd.read_csv("users_data.csv",index_col=0)
users_data

         name gender  age marital_status     city  salary
1       Alice      F   28        Married   Boston   60769
2         Bob      M   41         Single   Boston  119735
3     Charlie      M   36        Married   Boston  122955
4       David      M   32       Divorced  Chicago  124925
5         Eva      F   29       Divorced  Seattle  127969
6       Frank      M   42         Single  Seattle   65311
7       Grace      F   28       Divorced       NY  163355
8       Henry      M   47       Divorced  Chicago  164724
9         Ivy      F   40        Married   Austin  143104
10       Jack      M   44         Single  Chicago  113707
11  Katherine      F   32        Married   Austin  145305
12        Leo      M   32        Married       NY   88693
13        Mia      F   45        Married       LA  131932
14       Noah      M   42        Married  Seattle  153016
15     Olivia      F   25        Married       NY  166970
16      Peter      M   29        Married  Seattle   85658
17      Quinn      F   45        Married   Boston  144478
18     Rachel      F   24         Single       LA   78431
19        Sam      M   43       Divorced       LA   62747
20     Taylor      F   42        Married       NY  119150

In [2]:
users_data[['name','age','city']]

         name  age     city
1       Alice   28   Boston
2         Bob   41   Boston
3     Charlie   36   Boston
4       David   32  Chicago
5         Eva   29  Seattle
6       Frank   42  Seattle
7       Grace   28       NY
8       Henry   47  Chicago
9         Ivy   40   Austin
10       Jack   44  Chicago
11  Katherine   32   Austin
12        Leo   32       NY
13        Mia   45       LA
14       Noah   42  Seattle
15     Olivia   25       NY
16      Peter   29  Seattle
17      Quinn   45   Boston
18     Rachel   24       LA
19        Sam   43       LA
20     Taylor   42       NY

In [3]:
users_data['city'].value_counts().sort_index()

city
Austin     2
Boston     4
Chicago    3
LA         3
NY         4
Seattle    4
Name: count, dtype: int64

In [4]:
users_data['marital_status'].value_counts()

marital_status
Married     11
Divorced     5
Single       4
Name: count, dtype: int64

In [5]:
users_data['gender'].value_counts()

gender
F    10
M    10
Name: count, dtype: int64

In [6]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     object
 1   gender          20 non-null     object
 2   age             20 non-null     int64
 3   marital_status  20 non-null     object
 4   city            20 non-null     object
 5   salary          20 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [7]:
users_data.describe()

             age         salary
count  20.000000      20.000000
mean   36.300000  119146.700000
std     7.547045   34700.769094
min    24.000000   60769.000000
25%    29.000000   87934.250000
50%    38.000000  123940.000000
75%    42.250000  144684.750000
max    47.000000  166970.000000

In [8]:
users_data.describe(include='object')

         name gender marital_status    city
count      20     20             20      20
unique     20      2              3       6
top     Alice      F        Married  Boston
freq        1     10             11       4

In [9]:
users_data['city'].count()

np.int64(20)

In [10]:
users_data['city'].unique()

array(['Boston', 'Chicago', 'Seattle', 'NY', 'Austin', 'LA'], dtype=object)

In [11]:
users_data['city'].nunique()

6

In [12]:
users_data.describe(include='all')

         name gender        age marital_status    city         salary
count      20     20  20.000000             20      20      20.000000
unique     20      2        NaN              3       6            NaN
top     Alice      F        NaN        Married  Boston            NaN
freq        1     10        NaN             11       4            NaN
mean      NaN    NaN  36.300000            NaN     NaN  119146.700000
std       NaN    NaN   7.547045            NaN     NaN   34700.769094
min       NaN    NaN  24.000000            NaN     NaN   60769.000000
25%       NaN    NaN  29.000000            NaN     NaN   87934.250000
50%       NaN    NaN  38.000000            NaN     NaN  123940.000000
75%       NaN    NaN  42.250000            NaN     NaN  144684.750000
max       NaN    NaN  47.000000            NaN     NaN  166970.000000

In [13]:
users_data.describe()

             age         salary
count  20.000000      20.000000
mean   36.300000  119146.700000
std     7.547045   34700.769094
min    24.000000   60769.000000
25%    29.000000   87934.250000
50%    38.000000  123940.000000
75%    42.250000  144684.750000
max    47.000000  166970.000000

In [14]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     object
 1   gender          20 non-null     object
 2   age             20 non-null     int64
 3   marital_status  20 non-null     object
 4   city            20 non-null     object
 5   salary          20 non-null     int64
dtypes: int64(2), object(4)
memory usage: 1.1+ KB

In [15]:
users_data['gender'] = users_data['gender'].astype('category')

In [16]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     object
 1   gender          20 non-null     category
 2   age             20 non-null     int64
 3   marital_status  20 non-null     object
 4   city            20 non-null     object
 5   salary          20 non-null     int64
dtypes: category(1), int64(2), object(3)
memory usage: 1.1+ KB

In [17]:
users_data['name']=users_data['name'].astype('category')
users_data['marital_status']=users_data['marital_status'].astype('category')
users_data['city']=users_data['city'].astype('category')

In [18]:
users_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 1 to 20
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            20 non-null     category
 1   gender          20 non-null     category
 2   age             20 non-null     int64
 3   marital_status  20 non-null     category
 4   city            20 non-null     category
 5   salary          20 non-null     int64
dtypes: category(4), int64(2)
memory usage: 1.7 KB

In [19]:
users_data.index

Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20], dtype='int64')

In [20]:
users_data['city'].value_counts()

city
Boston     4
NY         4
Seattle    4
Chicago    3
LA         3
Austin     2
Name: count, dtype: int64

In [21]:
#sort data by age
users_data=(
    users_data
     .sort_values(by="salary",ascending=False)
     .reset_index(drop=True)
)
users_data.index=users_data.index+1
users_data

         name gender  age marital_status     city  salary
1      Olivia      F   25        Married       NY  166970
2       Henry      M   47       Divorced  Chicago  164724
3       Grace      F   28       Divorced       NY  163355
4        Noah      M   42        Married  Seattle  153016
5   Katherine      F   32        Married   Austin  145305
6       Quinn      F   45        Married   Boston  144478
7         Ivy      F   40        Married   Austin  143104
8         Mia      F   45        Married       LA  131932
9         Eva      F   29       Divorced  Seattle  127969
10      David      M   32       Divorced  Chicago  124925
11    Charlie      M   36        Married   Boston  122955
12        Bob      M   41         Single   Boston  119735
13     Taylor      F   42        Married       NY  119150
14       Jack      M   44         Single  Chicago  113707
15        Leo      M   32        Married       NY   88693
16      Peter      M   29        Married  Seattle   85658
17     Rachel      F   24         Single       LA   78431
18      Frank      M   42         Single  Seattle   65311
19        Sam      M   43       Divorced       LA   62747
20      Alice      F   28        Married   Boston   60769

In [22]:
users_data=(
  users_data
    .sort_values(by=["age","salary"],ascending=[True,False])
    .reset_index(drop=True)
    
)
users_data.index=range(1,len(users_data)+1)
#display results
users_data

         name gender  age marital_status     city  salary
1      Rachel      F   24         Single       LA   78431
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
5         Eva      F   29       Divorced  Seattle  127969
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
15      Frank      M   42         Single  Seattle   65311
16        Sam      M   43       Divorced       LA   62747
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [23]:
users_data.loc[1]

name              Rachel
gender                 F
age                   24
marital_status    Single
city                  LA
salary             78431
Name: 1, dtype: object

In [24]:
users_data.loc[5]

name                   Eva
gender                   F
age                     29
marital_status    Divorced
city               Seattle
salary              127969
Name: 5, dtype: object

In [25]:
users_data.loc[[1,3,6,8],["name","city","salary"]]

     name     city  salary
1  Rachel       LA   78431
3   Grace       NY  163355
6   Peter  Seattle   85658
8   David  Chicago  124925

In [26]:
users_data.loc[1:6,"salary"]

1     78431
2    166970
3    163355
4     60769
5    127969
6     85658
Name: salary, dtype: int64

In [27]:
users_data.iloc[1]

name               Olivia
gender                  F
age                    25
marital_status    Married
city                   NY
salary             166970
Name: 2, dtype: object

In [28]:
users_data.iloc[6]

name              Katherine
gender                    F
age                      32
marital_status      Married
city                 Austin
salary               145305
Name: 7, dtype: object

In [29]:
users_data.iloc[[0,2,5],[1,3,5]]

  gender marital_status  salary
1      F         Single   78431
3      F       Divorced  163355
6      M        Married   85658

In [30]:
users_data

         name gender  age marital_status     city  salary
1      Rachel      F   24         Single       LA   78431
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
5         Eva      F   29       Divorced  Seattle  127969
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
15      Frank      M   42         Single  Seattle   65311
16        Sam      M   43       Divorced       LA   62747
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [31]:
users_data.iloc[0:7,[0,2,3]]

        name  age marital_status
1     Rachel   24         Single
2     Olivia   25        Married
3      Grace   28       Divorced
4      Alice   28        Married
5        Eva   29       Divorced
6      Peter   29        Married
7  Katherine   32        Married

In [32]:
users_data.loc[1:3,["name","age","salary"]]

     name  age  salary
1  Rachel   24   78431
2  Olivia   25  166970
3   Grace   28  163355

In [33]:
users_data.loc[[1,3],"name":"city"]

     name gender  age marital_status city
1  Rachel      F   24         Single   LA
3   Grace      F   28       Divorced   NY

In [34]:
is_married=(users_data['marital_status']=='Married')
users_data[is_married]

         name gender  age marital_status     city  salary
2      Olivia      F   25        Married       NY  166970
4       Alice      F   28        Married   Boston   60769
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932

In [35]:
salary_above_120000=(users_data['salary']>=120000)
users_data[salary_above_120000]

         name gender  age marital_status     city  salary
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
5         Eva      F   29       Divorced  Seattle  127969
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
13       Noah      M   42        Married  Seattle  153016
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [36]:
users_data

         name gender  age marital_status     city  salary
1      Rachel      F   24         Single       LA   78431
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
5         Eva      F   29       Divorced  Seattle  127969
6       Peter      M   29        Married  Seattle   85658
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
13       Noah      M   42        Married  Seattle  153016
14     Taylor      F   42        Married       NY  119150
15      Frank      M   42         Single  Seattle   65311
16        Sam      M   43       Divorced       LA   62747
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
19        Mia      F   45        Married       LA  131932
20      Henry      M   47       Divorced  Chicago  164724

In [37]:
#select users from seattle
users_from_seattle=(users_data['city']=='Seattle')
users_from_seattle

1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15     True
16    False
17    False
18    False
19    False
20    False
Name: city, dtype: bool

In [38]:
#select only rows where users come from seattle
users_data[users_from_seattle]

     name gender  age marital_status     city  salary
5     Eva      F   29       Divorced  Seattle  127969
6   Peter      M   29        Married  Seattle   85658
13   Noah      M   42        Married  Seattle  153016
15  Frank      M   42         Single  Seattle   65311

In [39]:
#select users from seattle
#select only users with 29 years
users_from_seattle_city=(users_data['city']=='Seattle')
user_years_equal_to_29=(users_data['age']==29)
users_from_seattle_city

1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15     True
16    False
17    False
18    False
19    False
20    False
Name: city, dtype: bool

In [40]:
users_data[users_from_seattle_city]

     name gender  age marital_status     city  salary
5     Eva      F   29       Divorced  Seattle  127969
6   Peter      M   29        Married  Seattle   85658
13   Noah      M   42        Married  Seattle  153016
15  Frank      M   42         Single  Seattle   65311

In [41]:
user_years_equal_to_29

1     False
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
Name: age, dtype: bool

In [42]:
#data for users from seattle city whose age is equal to 29 years old
users_data[user_years_equal_to_29]

    name gender  age marital_status     city  salary
5    Eva      F   29       Divorced  Seattle  127969
6  Peter      M   29        Married  Seattle   85658

In [43]:
combined_data=users_from_seattle_city & user_years_equal_to_29
users_data[combined_data]

    name gender  age marital_status     city  salary
5    Eva      F   29       Divorced  Seattle  127969
6  Peter      M   29        Married  Seattle   85658

In [44]:
users_data['city'].value_counts()

city
Boston     4
NY         4
Seattle    4
Chicago    3
LA         3
Austin     2
Name: count, dtype: int64

In [45]:
#select rows with city seattle or city la
city_seattle=(users_data['city']=='Seattle')
city_la=(users_data['city']=='LA')
city_la_or_seattle=city_seattle|city_la
city_la_or_seattle

1      True
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13     True
14    False
15     True
16     True
17    False
18    False
19     True
20    False
Name: city, dtype: bool

In [46]:
users_data[city_la_or_seattle]

      name gender  age marital_status     city  salary
1   Rachel      F   24         Single       LA   78431
5      Eva      F   29       Divorced  Seattle  127969
6    Peter      M   29        Married  Seattle   85658
13    Noah      M   42        Married  Seattle  153016
15   Frank      M   42         Single  Seattle   65311
16     Sam      M   43       Divorced       LA   62747
19     Mia      F   45        Married       LA  131932

In [47]:
#users not from la or seattle
not_la_or_seattle=~city_la_or_seattle
not_la_or_seattle.value_counts()

city
True     13
False     7
Name: count, dtype: int64

In [48]:
users_data[not_la_or_seattle]

         name gender  age marital_status     city  salary
2      Olivia      F   25        Married       NY  166970
3       Grace      F   28       Divorced       NY  163355
4       Alice      F   28        Married   Boston   60769
7   Katherine      F   32        Married   Austin  145305
8       David      M   32       Divorced  Chicago  124925
9         Leo      M   32        Married       NY   88693
10    Charlie      M   36        Married   Boston  122955
11        Ivy      F   40        Married   Austin  143104
12        Bob      M   41         Single   Boston  119735
14     Taylor      F   42        Married       NY  119150
17       Jack      M   44         Single  Chicago  113707
18      Quinn      F   45        Married   Boston  144478
20      Henry      M   47       Divorced  Chicago  164724

In [49]:
not_la_or_seattle.value_counts()

city
True     13
False     7
Name: count, dtype: int64

In [50]:
users_data[city_seattle|city_la]

      name gender  age marital_status     city  salary
1   Rachel      F   24         Single       LA   78431
5      Eva      F   29       Divorced  Seattle  127969
6    Peter      M   29        Married  Seattle   85658
13    Noah      M   42        Married  Seattle  153016
15   Frank      M   42         Single  Seattle   65311
16     Sam      M   43       Divorced       LA   62747
19     Mia      F   45        Married       LA  131932

In [51]:
users_data[users_from_seattle_city & user_years_equal_to_29]

    name gender  age marital_status     city  salary
5    Eva      F   29       Divorced  Seattle  127969
6  Peter      M   29        Married  Seattle   85658

In [52]:
column_mapper={"salary":"annual_salary"}
users_data=users_data.rename(mapper=column_mapper,axis=1)
users_data

         name gender  age marital_status     city  annual_salary
1      Rachel      F   24         Single       LA          78431
2      Olivia      F   25        Married       NY         166970
3       Grace      F   28       Divorced       NY         163355
4       Alice      F   28        Married   Boston          60769
5         Eva      F   29       Divorced  Seattle         127969
6       Peter      M   29        Married  Seattle          85658
7   Katherine      F   32        Married   Austin         145305
8       David      M   32       Divorced  Chicago         124925
9         Leo      M   32        Married       NY          88693
10    Charlie      M   36        Married   Boston         122955
11        Ivy      F   40        Married   Austin         143104
12        Bob      M   41         Single   Boston         119735
13       Noah      M   42        Married  Seattle         153016
14     Taylor      F   42        Married       NY         119150
15      Frank      M   42         Single  Seattle          65311
16        Sam      M   43       Divorced       LA          62747
17       Jack      M   44         Single  Chicago         113707
18      Quinn      F   45        Married   Boston         144478
19        Mia      F   45        Married       LA         131932
20      Henry      M   47       Divorced  Chicago         164724

In [53]:
drop_column_marital_status=["marital_status"]
users_data=users_data.drop(labels=drop_column_marital_status,axis=1)
users_data

         name gender  age     city  annual_salary
1      Rachel      F   24       LA          78431
2      Olivia      F   25       NY         166970
3       Grace      F   28       NY         163355
4       Alice      F   28   Boston          60769
5         Eva      F   29  Seattle         127969
6       Peter      M   29  Seattle          85658
7   Katherine      F   32   Austin         145305
8       David      M   32  Chicago         124925
9         Leo      M   32       NY          88693
10    Charlie      M   36   Boston         122955
11        Ivy      F   40   Austin         143104
12        Bob      M   41   Boston         119735
13       Noah      M   42  Seattle         153016
14     Taylor      F   42       NY         119150
15      Frank      M   42  Seattle          65311
16        Sam      M   43       LA          62747
17       Jack      M   44  Chicago         113707
18      Quinn      F   45   Boston         144478
19        Mia      F   45       LA         131932
20      Henry      M   47  Chicago         164724

In [54]:
user_name_column={"name":"username"}
users_data=users_data.rename(mapper=user_name_column,axis=1)
users_data

     username gender  age     city  annual_salary
1      Rachel      F   24       LA          78431
2      Olivia      F   25       NY         166970
3       Grace      F   28       NY         163355
4       Alice      F   28   Boston          60769
5         Eva      F   29  Seattle         127969
6       Peter      M   29  Seattle          85658
7   Katherine      F   32   Austin         145305
8       David      M   32  Chicago         124925
9         Leo      M   32       NY          88693
10    Charlie      M   36   Boston         122955
11        Ivy      F   40   Austin         143104
12        Bob      M   41   Boston         119735
13       Noah      M   42  Seattle         153016
14     Taylor      F   42       NY         119150
15      Frank      M   42  Seattle          65311
16        Sam      M   43       LA          62747
17       Jack      M   44  Chicago         113707
18      Quinn      F   45   Boston         144478
19        Mia      F   45       LA         131932
20      Henry      M   47  Chicago         164724

In [55]:
users_data.rename(index={1: "user_1", 2: "user_2"}, inplace=True)

users_data

         username gender  age     city  annual_salary
user_1     Rachel      F   24       LA          78431
user_2     Olivia      F   25       NY         166970
3           Grace      F   28       NY         163355
4           Alice      F   28   Boston          60769
5             Eva      F   29  Seattle         127969
6           Peter      M   29  Seattle          85658
7       Katherine      F   32   Austin         145305
8           David      M   32  Chicago         124925
9             Leo      M   32       NY          88693
10        Charlie      M   36   Boston         122955
11            Ivy      F   40   Austin         143104
12            Bob      M   41   Boston         119735
13           Noah      M   42  Seattle         153016
14         Taylor      F   42       NY         119150
15          Frank      M   42  Seattle          65311
16            Sam      M   43       LA          62747
17           Jack      M   44  Chicago         113707
18          Quinn      F   45   Boston         144478
19            Mia      F   45       LA         131932
20          Henry      M   47  Chicago         164724

In [56]:
users_data

         username gender  age     city  annual_salary
user_1     Rachel      F   24       LA          78431
user_2     Olivia      F   25       NY         166970
3           Grace      F   28       NY         163355
4           Alice      F   28   Boston          60769
5             Eva      F   29  Seattle         127969
6           Peter      M   29  Seattle          85658
7       Katherine      F   32   Austin         145305
8           David      M   32  Chicago         124925
9             Leo      M   32       NY          88693
10        Charlie      M   36   Boston         122955
11            Ivy      F   40   Austin         143104
12            Bob      M   41   Boston         119735
13           Noah      M   42  Seattle         153016
14         Taylor      F   42       NY         119150
15          Frank      M   42  Seattle          65311
16            Sam      M   43       LA          62747
17           Jack      M   44  Chicago         113707
18          Quinn      F   45   Boston         144478
19            Mia      F   45       LA         131932
20          Henry      M   47  Chicago         164724

In [57]:
users_data.rename(index={"user_1":1,"user_2":2},inplace=True)
users_data

     username gender  age     city  annual_salary
1      Rachel      F   24       LA          78431
2      Olivia      F   25       NY         166970
3       Grace      F   28       NY         163355
4       Alice      F   28   Boston          60769
5         Eva      F   29  Seattle         127969
6       Peter      M   29  Seattle          85658
7   Katherine      F   32   Austin         145305
8       David      M   32  Chicago         124925
9         Leo      M   32       NY          88693
10    Charlie      M   36   Boston         122955
11        Ivy      F   40   Austin         143104
12        Bob      M   41   Boston         119735
13       Noah      M   42  Seattle         153016
14     Taylor      F   42       NY         119150
15      Frank      M   42  Seattle          65311
16        Sam      M   43       LA          62747
17       Jack      M   44  Chicago         113707
18      Quinn      F   45   Boston         144478
19        Mia      F   45       LA         131932
20      Henry      M   47  Chicago         164724

In [58]:
total_users_salary=users_data['annual_salary'].sum()
print(f"Total salaries paid out: {total_users_salary} Kenyan shillings")

Total salaries paid out: 2382934 Kenyan shillings

In [59]:
average_salary=users_data['annual_salary'].mean()
print("Average salary: ",average_salary)

Average salary:  119146.7

In [60]:
minimum_salary=users_data['annual_salary'].min()
print(f"Minimum salary: {minimum_salary} Kenyan shillings")

Minimum salary: 60769 Kenyan shillings

In [61]:
maximum_salary=users_data['annual_salary'].max()
print(f"Maximum salary: {maximum_salary} Kenyan shillings")

Maximum salary: 166970 Kenyan shillings

In [62]:
total_non_null_values=users_data['annual_salary'].count()
print("Non null values: ",total_non_null_values)

Non null values:  20

In [63]:
not_null_values=~total_non_null_values
print("Total null: ",not_null_values)

Total null:  -21

In [64]:
users_data

     username gender  age     city  annual_salary
1      Rachel      F   24       LA          78431
2      Olivia      F   25       NY         166970
3       Grace      F   28       NY         163355
4       Alice      F   28   Boston          60769
5         Eva      F   29  Seattle         127969
6       Peter      M   29  Seattle          85658
7   Katherine      F   32   Austin         145305
8       David      M   32  Chicago         124925
9         Leo      M   32       NY          88693
10    Charlie      M   36   Boston         122955
11        Ivy      F   40   Austin         143104
12        Bob      M   41   Boston         119735
13       Noah      M   42  Seattle         153016
14     Taylor      F   42       NY         119150
15      Frank      M   42  Seattle          65311
16        Sam      M   43       LA          62747
17       Jack      M   44  Chicago         113707
18      Quinn      F   45   Boston         144478
19        Mia      F   45       LA         131932
20      Henry      M   47  Chicago         164724

In [65]:
users_data.dtypes

username         category
gender           category
age                 int64
city             category
annual_salary       int64
dtype: object

In [68]:
bonuses = [500, 700, 600, 550, 650, 700, 400, 800, 450, 600, 550, 500, 750, 650, 600, 700, 500, 450, 550, 650]
users_data['Bonus']=bonuses
users_data

     username gender  age     city  annual_salary  Bonus
1      Rachel      F   24       LA          78431    500
2      Olivia      F   25       NY         166970    700
3       Grace      F   28       NY         163355    600
4       Alice      F   28   Boston          60769    550
5         Eva      F   29  Seattle         127969    650
6       Peter      M   29  Seattle          85658    700
7   Katherine      F   32   Austin         145305    400
8       David      M   32  Chicago         124925    800
9         Leo      M   32       NY          88693    450
10    Charlie      M   36   Boston         122955    600
11        Ivy      F   40   Austin         143104    550
12        Bob      M   41   Boston         119735    500
13       Noah      M   42  Seattle         153016    750
14     Taylor      F   42       NY         119150    650
15      Frank      M   42  Seattle          65311    600
16        Sam      M   43       LA          62747    700
17       Jack      M   44  Chicago         113707    500
18      Quinn      F   45   Boston         144478    450
19        Mia      F   45       LA         131932    550
20      Henry      M   47  Chicago         164724    650

In [69]:
users_data['religion']="Christian"
users_data

     username gender  age     city  annual_salary  Bonus   religion
1      Rachel      F   24       LA          78431    500  Christian
2      Olivia      F   25       NY         166970    700  Christian
3       Grace      F   28       NY         163355    600  Christian
4       Alice      F   28   Boston          60769    550  Christian
5         Eva      F   29  Seattle         127969    650  Christian
6       Peter      M   29  Seattle          85658    700  Christian
7   Katherine      F   32   Austin         145305    400  Christian
8       David      M   32  Chicago         124925    800  Christian
9         Leo      M   32       NY          88693    450  Christian
10    Charlie      M   36   Boston         122955    600  Christian
11        Ivy      F   40   Austin         143104    550  Christian
12        Bob      M   41   Boston         119735    500  Christian
13       Noah      M   42  Seattle         153016    750  Christian
14     Taylor      F   42       NY         119150    650  Christian
15      Frank      M   42  Seattle          65311    600  Christian
16        Sam      M   43       LA          62747    700  Christian
17       Jack      M   44  Chicago         113707    500  Christian
18      Quinn      F   45   Boston         144478    450  Christian
19        Mia      F   45       LA         131932    550  Christian
20      Henry      M   47  Chicago         164724    650  Christian

In [70]:
users_data['higher_earner']=users_data['annual_salary']>=100000
users_data

,username,gender,age,city,annual_salary,Bonus,religion,higher_earner
1,Rachel,F,24,LA,78431,500,Christian,False
2,Olivia,F,25,NY,166970,700,Christian,True
3,Grace,F,28,NY,163355,600,Christian,True
4,Alice,F,28,Boston,60769,550,Christian,False
5,Eva,F,29,Seattle,127969,650,Christian,True
6,Peter,M,29,Seattle,85658,700,Christian,False
7,Katherine,F,32,Austin,145305,400,Christian,True
8,David,M,32,Chicago,124925,800,Christian,True
9,Leo,M,32,NY,88693,450,Christian,False
10,Charlie,M,36,Boston,122955,600,Christian,True
11,Ivy,F,40,Austin,143104,550,Christian,True
12,Bob,M,41,Boston,119735,500,Christian,True
13,Noah,M,42,Seattle,153016,750,Christian,True
14,Taylor,F,42,NY,119150,650,Christian,True
15,Frank,M,42,Seattle,65311,600,Christian,False
16,Sam,M,43,LA,62747,700,Christian,False
17,Jack,M,44,Chicago,113707,500,Christian,True
18,Quinn,F,45,Boston,144478,450,Christian,True
19,Mia,F,45,LA,131932,550,Christian,True
20,Henry,M,47,Chicago,164724,650,Christian,True

In [71]:
users_data['salary_label']=users_data['annual_salary'].apply(lambda x:"High" if x > 100000 else "Low")
users_data

,username,gender,age,city,annual_salary,Bonus,religion,higher_earner,salary_label
1,Rachel,F,24,LA,78431,500,Christian,False,Low
2,Olivia,F,25,NY,166970,700,Christian,True,High
3,Grace,F,28,NY,163355,600,Christian,True,High
4,Alice,F,28,Boston,60769,550,Christian,False,Low
5,Eva,F,29,Seattle,127969,650,Christian,True,High
6,Peter,M,29,Seattle,85658,700,Christian,False,Low
7,Katherine,F,32,Austin,145305,400,Christian,True,High
8,David,M,32,Chicago,124925,800,Christian,True,High
9,Leo,M,32,NY,88693,450,Christian,False,Low
10,Charlie,M,36,Boston,122955,600,Christian,True,High
11,Ivy,F,40,Austin,143104,550,Christian,True,High
12,Bob,M,41,Boston,119735,500,Christian,True,High
13,Noah,M,42,Seattle,153016,750,Christian,True,High
14,Taylor,F,42,NY,119150,650,Christian,True,High
15,Frank,M,42,Seattle,65311,600,Christian,False,Low
16,Sam,M,43,LA,62747,700,Christian,False,Low
17,Jack,M,44,Chicago,113707,500,Christian,True,High
18,Quinn,F,45,Boston,144478,450,Christian,True,High
19,Mia,F,45,LA,131932,550,Christian,True,High
20,Henry,M,47,Chicago,164724,650,Christian,True,High

In [72]:
users_data

,username,gender,age,city,annual_salary,Bonus,religion,higher_earner,salary_label
1,Rachel,F,24,LA,78431,500,Christian,False,Low
2,Olivia,F,25,NY,166970,700,Christian,True,High
3,Grace,F,28,NY,163355,600,Christian,True,High
4,Alice,F,28,Boston,60769,550,Christian,False,Low
5,Eva,F,29,Seattle,127969,650,Christian,True,High
6,Peter,M,29,Seattle,85658,700,Christian,False,Low
7,Katherine,F,32,Austin,145305,400,Christian,True,High
8,David,M,32,Chicago,124925,800,Christian,True,High
9,Leo,M,32,NY,88693,450,Christian,False,Low
10,Charlie,M,36,Boston,122955,600,Christian,True,High
11,Ivy,F,40,Austin,143104,550,Christian,True,High
12,Bob,M,41,Boston,119735,500,Christian,True,High
13,Noah,M,42,Seattle,153016,750,Christian,True,High
14,Taylor,F,42,NY,119150,650,Christian,True,High
15,Frank,M,42,Seattle,65311,600,Christian,False,Low
16,Sam,M,43,LA,62747,700,Christian,False,Low
17,Jack,M,44,Chicago,113707,500,Christian,True,High
18,Quinn,F,45,Boston,144478,450,Christian,True,High
19,Mia,F,45,LA,131932,550,Christian,True,High
20,Henry,M,47,Chicago,164724,650,Christian,True,High

In [82]:
users_data["name_city"]=users_data["username"].astype(str) + "," +  users_data["city"].astype(str)
users_data

,username,gender,age,city,annual_salary,Bonus,religion,higher_earner,salary_label,name_city
1,Rachel,F,24,LA,78431,500,Christian,False,Low,"Rachel,LA"
2,Olivia,F,25,NY,166970,700,Christian,True,High,"Olivia,NY"
3,Grace,F,28,NY,163355,600,Christian,True,High,"Grace,NY"
4,Alice,F,28,Boston,60769,550,Christian,False,Low,"Alice,Boston"
5,Eva,F,29,Seattle,127969,650,Christian,True,High,"Eva,Seattle"
6,Peter,M,29,Seattle,85658,700,Christian,False,Low,"Peter,Seattle"
7,Katherine,F,32,Austin,145305,400,Christian,True,High,"Katherine,Austin"
8,David,M,32,Chicago,124925,800,Christian,True,High,"David,Chicago"
9,Leo,M,32,NY,88693,450,Christian,False,Low,"Leo,NY"
10,Charlie,M,36,Boston,122955,600,Christian,True,High,"Charlie,Boston"
11,Ivy,F,40,Austin,143104,550,Christian,True,High,"Ivy,Austin"
12,Bob,M,41,Boston,119735,500,Christian,True,High,"Bob,Boston"
13,Noah,M,42,Seattle,153016,750,Christian,True,High,"Noah,Seattle"
14,Taylor,F,42,NY,119150,650,Christian,True,High,"Taylor,NY"
15,Frank,M,42,Seattle,65311,600,Christian,False,Low,"Frank,Seattle"
16,Sam,M,43,LA,62747,700,Christian,False,Low,"Sam,LA"
17,Jack,M,44,Chicago,113707,500,Christian,True,High,"Jack,Chicago"
18,Quinn,F,45,Boston,144478,450,Christian,True,High,"Quinn,Boston"
19,Mia,F,45,LA,131932,550,Christian,True,High,"Mia,LA"
20,Henry,M,47,Chicago,164724,650,Christian,True,High,"Henry,Chicago"

In [87]:
split_data=users_data['name_city'].str.split(",",expand=True)
split_data.columns=["name_split","city_split"]
split_data

   name_split city_split
1      Rachel         LA
2      Olivia         NY
3       Grace         NY
4       Alice     Boston
5         Eva    Seattle
6       Peter    Seattle
7   Katherine     Austin
8       David    Chicago
9         Leo         NY
10    Charlie     Boston
11        Ivy     Austin
12        Bob     Boston
13       Noah    Seattle
14     Taylor         NY
15      Frank    Seattle
16        Sam         LA
17       Jack    Chicago
18      Quinn     Boston
19        Mia         LA
20      Henry    Chicago

In [88]:
users_data[['name_split','city_split']]=users_data['name_city'].str.split(",",expand=True)
users_data

,username,gender,age,city,annual_salary,Bonus,religion,higher_earner,salary_label,name_city,name_split,city_split
1,Rachel,F,24,LA,78431,500,Christian,False,Low,"Rachel,LA",Rachel,LA
2,Olivia,F,25,NY,166970,700,Christian,True,High,"Olivia,NY",Olivia,NY
3,Grace,F,28,NY,163355,600,Christian,True,High,"Grace,NY",Grace,NY
4,Alice,F,28,Boston,60769,550,Christian,False,Low,"Alice,Boston",Alice,Boston
5,Eva,F,29,Seattle,127969,650,Christian,True,High,"Eva,Seattle",Eva,Seattle
6,Peter,M,29,Seattle,85658,700,Christian,False,Low,"Peter,Seattle",Peter,Seattle
7,Katherine,F,32,Austin,145305,400,Christian,True,High,"Katherine,Austin",Katherine,Austin
8,David,M,32,Chicago,124925,800,Christian,True,High,"David,Chicago",David,Chicago
9,Leo,M,32,NY,88693,450,Christian,False,Low,"Leo,NY",Leo,NY
10,Charlie,M,36,Boston,122955,600,Christian,True,High,"Charlie,Boston",Charlie,Boston
11,Ivy,F,40,Austin,143104,550,Christian,True,High,"Ivy,Austin",Ivy,Austin
12,Bob,M,41,Boston,119735,500,Christian,True,High,"Bob,Boston",Bob,Boston
13,Noah,M,42,Seattle,153016,750,Christian,True,High,"Noah,Seattle",Noah,Seattle
14,Taylor,F,42,NY,119150,650,Christian,True,High,"Taylor,NY",Taylor,NY
15,Frank,M,42,Seattle,65311,600,Christian,False,Low,"Frank,Seattle",Frank,Seattle
16,Sam,M,43,LA,62747,700,Christian,False,Low,"Sam,LA",Sam,LA
17,Jack,M,44,Chicago,113707,500,Christian,True,High,"Jack,Chicago",Jack,Chicago
18,Quinn,F,45,Boston,144478,450,Christian,True,High,"Quinn,Boston",Quinn,Boston
19,Mia,F,45,LA,131932,550,Christian,True,High,"Mia,LA",Mia,LA
20,Henry,M,47,Chicago,164724,650,Christian,True,High,"Henry,Chicago",Henry,Chicago

In [89]:
users_data['combined']=users_data['username'].str.cat(users_data['city'],sep=",")
users_data

,username,gender,age,city,annual_salary,Bonus,religion,higher_earner,salary_label,name_city,name_split,city_split,combined
1,Rachel,F,24,LA,78431,500,Christian,False,Low,"Rachel,LA",Rachel,LA,"Rachel,LA"
2,Olivia,F,25,NY,166970,700,Christian,True,High,"Olivia,NY",Olivia,NY,"Olivia,NY"
3,Grace,F,28,NY,163355,600,Christian,True,High,"Grace,NY",Grace,NY,"Grace,NY"
4,Alice,F,28,Boston,60769,550,Christian,False,Low,"Alice,Boston",Alice,Boston,"Alice,Boston"
5,Eva,F,29,Seattle,127969,650,Christian,True,High,"Eva,Seattle",Eva,Seattle,"Eva,Seattle"
6,Peter,M,29,Seattle,85658,700,Christian,False,Low,"Peter,Seattle",Peter,Seattle,"Peter,Seattle"
7,Katherine,F,32,Austin,145305,400,Christian,True,High,"Katherine,Austin",Katherine,Austin,"Katherine,Austin"
8,David,M,32,Chicago,124925,800,Christian,True,High,"David,Chicago",David,Chicago,"David,Chicago"
9,Leo,M,32,NY,88693,450,Christian,False,Low,"Leo,NY",Leo,NY,"Leo,NY"
10,Charlie,M,36,Boston,122955,600,Christian,True,High,"Charlie,Boston",Charlie,Boston,"Charlie,Boston"
11,Ivy,F,40,Austin,143104,550,Christian,True,High,"Ivy,Austin",Ivy,Austin,"Ivy,Austin"
12,Bob,M,41,Boston,119735,500,Christian,True,High,"Bob,Boston",Bob,Boston,"Bob,Boston"
13,Noah,M,42,Seattle,153016,750,Christian,True,High,"Noah,Seattle",Noah,Seattle,"Noah,Seattle"
14,Taylor,F,42,NY,119150,650,Christian,True,High,"Taylor,NY",Taylor,NY,"Taylor,NY"
15,Frank,M,42,Seattle,65311,600,Christian,False,Low,"Frank,Seattle",Frank,Seattle,"Frank,Seattle"
16,Sam,M,43,LA,62747,700,Christian,False,Low,"Sam,LA",Sam,LA,"Sam,LA"
17,Jack,M,44,Chicago,113707,500,Christian,True,High,"Jack,Chicago",Jack,Chicago,"Jack,Chicago"
18,Quinn,F,45,Boston,144478,450,Christian,True,High,"Quinn,Boston",Quinn,Boston,"Quinn,Boston"
19,Mia,F,45,LA,131932,550,Christian,True,High,"Mia,LA",Mia,LA,"Mia,LA"
20,Henry,M,47,Chicago,164724,650,Christian,True,High,"Henry,Chicago",Henry,Chicago,"Henry,Chicago"